//#include <stdio.h>
//
//int main() {
//	// 지정한 숫자 만큼의 '*'을 for문을 사용해서 출력하는 코드를 작성하세요
//	/*char star = '*';
//	int count=100;
//	for (int i = 0; i <= count; i++) {
//		printf("%c", star);
//	}
//	puts("");*/
//	//// 선생님꺼
//	/*int star;
//	printf("횟수 입력 > "); scanf_s("%d", &star);
//	puts("");
//	for (int i = 0; i < star; i++) {
//		putchar('*');
//	}
//	puts("");*/
//
//
//	// 1 ~ 100 사이의 3의 배수, 5의 배수 값을 출력하고,
//	// 각 배수의 합을 구하는 코드를 작성하세요
//	// 단, 3의 배수이면서 5의 배수도 되는 숫자는 한번만 출력되어야 합니다
//	//int sum = 0;
//	//for (int i = 1; i <= 100; i++) {
//	//	if (i % 3 == 0) {
//	//		printf("%d\n", i);
//	//		sum += i;
//	//	}
//	//	else if (i % 5 == 0) {
//	//		printf("%d\n", i);
//	//		sum += i;
//	//	}
//	//}
//	//printf("1~100사이의 3의배수와 5의배수의 합: %d\n", sum); //이게 아니라 각 배수의 합을 구해야됨
//	////// 선생님꺼
//	//int n1 = 3;
//	//int n2 = 5;
//	//int start = 1;
//	//int end = 100;
//	//int n1_sum = 0;
//	//int n2_sum = 0;
//	//for (int i = start; i <= end; i++) {
//	//	if (i % n1 == 0 && i % n2 == 0) {
//	//		printf("%d : %d and %d 의 배수\n", i, n1, n2);
//	//		n1_sum += i;
//	//		n2_sum += i;
//	//	}
//	//	else if (i % n1 == 0) {
//	//		printf("%d : %d 의 배수\n", i, n1);
//	//		n1_sum += i;
//	//	}
//	//	else if (i % n2 == 0) {
//	//		printf("%d : %d 의 배수\n", i, n2);
//	//		n2_sum += i;
//	//	}
//	//}
//	//puts("");
//	//printf("%d 의 배수 합 : %d\n", n1, n1_sum);
//	//printf("%d 의 배수 합 : %d\n", n2, n2_sum);
//
//	//// 알파벳 대문자 A ~ Z 까지를 출력하는 코드를 작성하세요
//	//// for문이 한번 실행 될때마다 알파벳 하나씩 출력하세요
//	//for (int i = 0; i < 26; i++) {
//	//	printf("%c ", 65+i);
//	//}
//	//puts("");
//	////선생님꺼
//	//for (int i = 65; i <= 90; i++) {
//	//	printf("%c ", i);
//	//}
//	//puts("");
//	//// for문에 char넣어서 하기
//	//for (char ch = 'A'; ch <= 'Z'; ch++) {
//	//	putchar(ch);
//	//	if (ch != 'Z')
//	//		printf(", ");
//	//}
//	//puts("");
//
//
//	//// 아래와 같이 구구단을 출력하는 코드를 작성하세요
//	//// - 2 * 1 =  2,   3 * 1 =  3,  4 * 1 =  4,  ...  9 * 1 =  9
//	////   2 * 2 =  4,   3 * 2 =  6,  4 * 2 =  8,  ...  9 * 2 = 18
//	////                   .............
//	////   2 * 9 = 18,   3 * 9 = 27,  4 * 9 = 36,  ...  9 * 9 = 81
//	//printf("--------- 구구단 ----------\n");
//	//for (int i = 1; i < 10; i++) {
//	//	for (int j = 2; j < 10; j++) {
//	//		printf("%d * %d = %2d  ", j, i, j * i);
//	//	}
//	//	puts("");
//	//}
//	//////선생님꺼
//	//for (int i = 1; i <= 9; i++) {
//
//	//	for (int dan = 2; dan <= 9; dan++) {
//	//		printf("%2d x %2d = %2d", dan, i, dan * i);
//	//		if (dan != 9)
//	//			printf(", ");
//	//	}
//	//	puts("");
//
//	//}
//
//
//	// 통장에 첫날에는 1원을 입금하고, 둘째날 부터는 전날 입금액의 두배를 입금합니다
//	// 위와 같은 방식으로 30일동안 입금한 총금액을 구하는 코드를 작성하세요
//	/*int sum = 1;
//	for (int i = 0; i < 30; i++) {
//		sum += i*2;
//		printf("%d째날 저금: %d\n", i+1, sum);
//	}
//	puts("");*/
//	// sum = 0 으로 하기  !!!틀림!!!
//	//int sum = 0;
//	//for (int i = 0; i < 30; i++) {
//	//	if (i == 0)
//	//		sum++;
//	//	else
//	//		sum += i * 2; // 2,4,8,16 이런식으로 곱해야 되는데(제곱) 이건 2,4,6,8 이런식으로 곱해짐(배수)
//	//	printf("%d째날 저금: %d\n", i+1, sum);
//	//}
//	////선생님꺼
//	//int money = 0;    // 입금
//	//int balance = 0;  // 잔액
//	//for (int day = 1; day <= 30; day++) {
//	//	if (day == 1)
//	//		money = 1;
//	//	else
//	//		money *= 2; // 이런식으로 곱해야 2의 제곱만큼 곱해짐
//	//	balance += money;
//	//	printf("%3d 일 - 입금 : %10d, 잔액 : %d\n", day, money, balance);
//	//}
//	//printf("총 입금액 : %d 원\n", balance);
//	
//	/*int m = 1;
//	int res = (m << 30) - 1;
//	printf("res : %d\n", res);*/
//}